org/Math/MathForFinance.org
#+TITLE:Mathematical Methods for Quantitative Finance
#+KEYWORDS: Math, Finance
#+OPTIONS: H:2 toc:2 num:3 ^:nil
#+OPTIONS: LaTeX:t
#+SETUPFILE: ../configOrg/level1.org
* Interest
$$A_0=Principal, r=rate, n=\#years, m=periods/year, k=\#periods$$
** Simple Interest
$$V=(1+rn)A_0$$

** Compound Interest
- Interest is paid regularly
  $$V = (1+r)^nA_0$$
- Interest rate r is yearly, interest is paid monthly
  $$V = [1+(r/m)]^kA_0$$

** Present & Future Value
$$FV = (1+r)PV$$
$$PV = \frac{1}{1+r}FV = d_1FV$$
where $d_1$ is the 1-year _discount factor_
$$d_k = \frac{1}{[1+(r/m)]^k}$$

* Annuities
An _annuity_ is a contract that pays money regularly over a period of time.
$$V=\frac{A}{r}[1-\frac{1}{(1+r)^n}]$$
** Perpetual Annuity
A _perpetual annuity_ pays a fixed amount periodically /forever/
$$V=\frac{A}{r}$$
