Math/MathForFinance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Mathematical Methods for Quantitative Finance</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Mathematical Methods for Quantitative Finance"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-06-17T22:41+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="Math, Finance"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">Mathematical Methods for Quantitative Finance</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Interest</a>
<ul>
<li><a href="#sec-1-1">1.1 Simple Interest</a></li>
<li><a href="#sec-1-2">1.2 Compound Interest</a></li>
<li><a href="#sec-1-3">1.3 Present &amp; Future Value</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Annuities</a>
<ul>
<li><a href="#sec-2-1">2.1 Perpetual Annuity</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Interest</h2>
<div class="outline-text-2" id="text-1">


$$A_0=Principal, r=rate, n=\#years, m=periods/year, k=\#periods$$

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Simple Interest</h3>
<div class="outline-text-3" id="text-1-1">


$$V=(1+rn)A_0$$

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Compound Interest</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>Interest is paid regularly
  $$V = (1+r)^nA_0$$
</li>
<li>Interest rate r is yearly, interest is paid monthly
  $$V = [1+(r/m)]^kA_0$$
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Present &amp; Future Value</h3>
<div class="outline-text-3" id="text-1-3">


$$FV = (1+r)PV$$
$$PV = \frac{1}{1+r}FV = d_1FV$$
<p>
where \(d_1\) is the 1-year <span style="text-decoration:underline;">discount factor</span>
$$d_k = \frac{1}{[1+(r/m)]^k}$$

</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Annuities</h2>
<div class="outline-text-2" id="text-2">

<p>An <span style="text-decoration:underline;">annuity</span> is a contract that pays money regularly over a period of time.
$$V=\frac{A}{r}[1-\frac{1}{(1+r)^n}]$$
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Perpetual Annuity</h3>
<div class="outline-text-3" id="text-2-1">

<p>A <span style="text-decoration:underline;">perpetual annuity</span> pays a fixed amount periodically <i>forever</i>
$$V=\frac{A}{r}$$
</p></div>
</div>
</div>
</div>

</body>
</html>
